---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnAndTargetAlreadyJoined
source: html/13df085a-2652-5242-26ed-ac07951e1d38.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnAndTargetAlreadyJoined Property

The column and target are joined, remove that join before attaching them.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnAndTargetAlreadyJoined { get; }
```